tests/auto_build/testcases/output/HandlerTest16Request.out

POST /Calculator/services/Calculator HTTP/1.1
Host: localhost:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "CalculatorDoc#add"
Content-Length: 963

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Header><ns2:basicNodeTest xmlns:ns2="http://soapinterop.org/basicNodeTest/"><bntn:basicNodeTestNode xmlns:bntn="http://soapinterop.org/basicNodeTestNode/" bntn:attr1="one" bntn:attr2="two" bntn:attr3="three" bntn:attr4="four" bntn:attr5="five"><bntc:basicNodeTestChild xmlns:bntc="http://soapinterop.org/basicNodeTestChild/">sub node value1</bntc:basicNodeTestChild><bntc2:basicNodeTestChild xmlns:bntc2="http://soapinterop.org/basicNodeTestChild2/">sub node value2</bntc2:basicNodeTestChild></bntn:basicNodeTestNode></ns2:basicNodeTest></SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:add xmlns:ns1="http://localhost/axis/Calculator">
<ns1:arg_0_0>2</ns1:arg_0_0>
<ns1:arg_1_0>3</ns1:arg_1_0>
</ns1:add>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

