tests/auto_build/testcases/output/DynamicSetSOAPMethodAttrTest2Request.out

POST /Calculator/services/Calculator HTTP/1.1
Host: localhost:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "Calculator#div"
Content-Length: 510

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:div xmlns:ns1="http://localhost/axis/Calculator" ns1:Name="Axis" ns1:Type="Open Source" xmlns:ns2="http://axis.apache.org" ns2:Lang="C++" Attr="withoutPrefix">
<ns1:arg_0_3>100</ns1:arg_0_3>
<ns1:arg_1_3>20</ns1:arg_1_3>
</ns1:div>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

